<body topmargin="0" leftmargin="0" bottommargin="0" rightmargin="0" bgcolor="#000000" style="color:#ffffff">
<b style="color:#ff0000">A Patchernek root jog sz&uuml;ks&eacute;ges a munk&aacute;hoz!</b><br/><br/>
<b>R&ouml;vid megjegyz&eacute;s:</b><br/>
-----------------<br/>
<b style="color:#36ff00">Z&ouml;ld</b> - Ez a program nagy es&eacute;llyel regisztr&aacute;lhat&oacute;<br/>
<b style="color:#fffc00">S&aacute;rga</b> - A programhoz egyedi patch tal&aacute;lhat&oacute; az /sdcard/LuckyPatcher/ mapp&aacute;ban<br/>
<b style="color:#00f0ff">Cyan</b> - A program Google Rekl&aacute;mot tartalmaz<br/>
<b style="color:#fc00ff">Magenta</b> - Ez a program a Boot-List&aacute;ban van<br/>
<b style="color:#ff0000">Lehetetlen</b> - Ennek a programnak nincs es&eacute;lye a regisztr&aacute;ci&oacute;ra. Kiv&eacute;tel a k&eacute;t r&eacute;szb&otilde;l &aacute;ll&oacute; alkalmaz&aacute;s (alkalmaz&aacute;s &eacute;s Pro-kulcs). Ilyen esetekben patchelni kell mindk&eacute;t oldalt, vagy az egyiket k&ouml;z&uuml;l&uuml;k.<br/>
<b style="color:#ff9c00">Narancs</b> - Rendszer alkalmaz&aacute;s. L&eacute;gyen nagyon &oacute;vatos az alkalmaz&aacute;sokon v&eacute;grehajtott m&ucirc;veletekkel, t&ouml;nkremehet az app. vagy ak&aacute;r az oper&aacute;ci&oacute;s rendszer is.<br/>
<b>Boot-Lista</b> - a rendszer ind&iacute;t&aacute;sakor patchelni k&iacute;v&aacute;nt f&aacute;jlok list&aacute;ja. Ezen a ponton csak a haszn&aacute;lni k&iacute;v&aacute;nt app.-ot sz&oacute;l&iacute;tja fel a ".so" mapp&aacute;k sz&uuml;ks&eacute;ges korrekci&oacute;j&aacute;ra. De egy&eacute;ni foltok nem l&eacute;teznek, kiv&eacute;ve a r&eacute;gi Titanium Backup-&eacute;t, amit m&aacute;r nem haszn&aacute;lunk.<br/>
<b style="color:#36ff00">L&oacute;here</b> - ebben a Patcher v&aacute;ltoztat&aacute;st v&eacute;gzett;<br/>
<b style="color:#fffc00">Csillag</b> - azt jelenti, hogy a Dalvik-cache-ben r&ouml;gz&iacute;tette az alkalmaz&aacute;sokat (a l&eacute;trehozott ODEX m&oacute;dos&iacute;t&aacute;sokkal), ez viszont azt jelenti, hogy az alkalmaz&aacute;s vagy az els&otilde; friss&iacute;t&eacute;sig vagy az alkalmaz&aacute;s t&ouml;rl&eacute;s&eacute;ig a jelenlegi &aacute;llapot&aacute;ban marad. Ha az ilyen ODEX-e elt&aacute;vol&iacute;tja, majd a Duplik&aacute;ci&oacute; teljes m&eacute;rt&eacute;kben vissza&aacute;ll a patch el&otilde;tti &aacute;llapotba. Probl&eacute;m&aacute;k mer&uuml;lhetnek fel az alkalmaz&aacute;s friss&iacute;t&eacute;sekor: a Google Play esk&uuml;szik, hogy nincs el&eacute;g hely. Futtassa a Lucky Patcher-t majd z&aacute;rja be &eacute;s pr&oacute;b&aacute;lja meg &uacute;jra telep&iacute;teni az alkalmaz&aacute;st, ha ilyen hiba&uuml;zenet &iacute;r&oacute;dik, hogy elt&aacute;vol&iacute;tott alkalmaz&aacute;s,
v&aacute;lassza a Lucky Patcher be&aacute;ll&iacute;t&aacute;sok "Hibaelh&aacute;r&iacute;t&aacute;ss - > Jav&iacute;t&aacute;sok &eacute;s biztons&aacute;gi ment&eacute;sek elt&aacute;vol&iacute;t&aacute;sa (app friss&iacute;t&eacute;se)" - minden program minden Dalvik-cache jav&iacute;t&aacute;sa el lesz t&aacute;vol&iacute;tva<br/><br/>
<b>Helyi men&uuml;:</b><br/>
-----------------<br/>
<b>Licensz ellen&otilde;rz&eacute;s elt&aacute;vol&iacute;t&aacute;sa (Auto m&oacute;d!)</b> - <em>Megk&iacute;s&eacute;rli a licenc ellen&otilde;rz&eacute;s elt&aacute;vol&iacute;t&aacute;s&aacute;t. A sablonok egy kis r&eacute;sz&eacute;t haszn&aacute;lja az alkalmaz&aacute;s legnagyobb stabilit&aacute;s&aacute;nak biztos&iacute;t&aacute;s&aacute;ra</em><br/>
<b>Licensz ellen&otilde;rz&eacute;s elt&aacute;vol&iacute;t&aacute;sa (Extr&eacute;m Auto m&oacute;d!)</b> - <em>Megk&iacute;s&eacute;rli a licenc ellen&otilde;rz&eacute;s elt&aacute;vol&iacute;t&aacute;s&aacute;t. Haszn&aacute;lja az &ouml;sszes sablont, az app nem stabil. Internet sz&uuml;ks&eacute;ges.</em><br/>
<b>Licensz ellen&otilde;rz&eacute;s elt&aacute;vol&iacute;t&aacute;sa (K&eacute;zi)</b> - <em>Megk&iacute;s&eacute;rli a licenc ellen&otilde;rz&eacute;s elt&aacute;vol&iacute;t&aacute;s&aacute;t. Elt&aacute;vol&iacute;t&aacute;s a brute force m&oacute;dszer&eacute;vel.</em><br/>
<b>Licensz ellen&otilde;rz&eacute;s elt&aacute;vol&iacute;t&aacute;sa (V&aacute;lasztott sablonok)</b> - <em>Megadhatja, hogy milyen csoport sablonokat kell alkalmazni.</em><br/>
<b>Google Rekl&aacute;mok elt&aacute;vol&iacute;t&aacute;sa!</b> - <em>Megk&iacute;s&eacute;rli a Google Rekl&aacute;mok elt&aacute;vol&iacute;t&aacute;s&aacute;t. N&eacute;ha elt&aacute;vol&iacute;t alkalmaz&aacute;sokb&oacute;l hirdet&eacute;seket, amelyben nem tal&aacute;lhat&oacute;k rekl&aacute;m c&iacute;mk&eacute;k (melyek Nem tal&aacute;lhat&oacute; &aacute;llapot&uacute;ak!)</em><br/>
<b>Elt&aacute;vol&iacute;tja a megv&aacute;ltozott ODEX-et</b> - <em>Elt&aacute;vol&iacute;tja a m&oacute;dos&iacute;t&aacute;sokat tartalmaz&oacute; ODEX f&aacute;jlt. Ily m&oacute;don vissza&aacute;ll&iacute;tja az alkalmaz&aacute;sok eredeti &aacute;llapot&aacute;t.</em><br/>
<b>Jogosults&aacute;gok v&aacute;ltoz&aacute;sa</b> - <em>Elt&aacute;vol&iacute;tja az alkalmaz&aacute;sok jogosults&aacute;gait. Legyen nagyon &oacute;vatos ezzel. Egyes eszk&ouml;z&ouml;k&ouml;n ez a m&oacute;dszer folyamatos &uacute;jraind&iacute;t&aacute;shoz vagy egy&eacute;b nem k&iacute;v&aacute;natos k&ouml;vetkezm&eacute;nyekhez vezethet. K&eacute;sz&iacute;tsen biztons&aacute;gi ment&eacute;st a rendszerr&otilde;l a jogosults&aacute;gok v&aacute;ltoztat&aacute;sa el&otilde;tt.</em><br/>
<b>M&oacute;dos&iacute;tott APK l&eacute;trehoz&aacute;sa</b> - <em>L&eacute;trehoz egy telep&iacute;t&otilde;csomag apk-t a rendelkez&eacute;sre &aacute;ll&oacute; jav&iacute;t&aacute;sok alapj&aacute;n. Tudnia kell, hogy egy &uacute;jra&eacute;p&iacute;tett apk-f&aacute;jl nem ugyanaz, mint egy m&aacute;r telep&iacute;tett alkalmaz&aacute;s patch-el&eacute;se. Az alkalmaz&aacute;s patchel&eacute;s&eacute;vel szemben nagyon k&ouml;nny&ucirc; tesztelni a v&aacute;ltoz&aacute;sokat, a telep&iacute;t&eacute;st &eacute;s ellen&otilde;rizni a korrekt m&ucirc;k&ouml;d&eacute;st.</em><br/>
<b>Patch &uacute;jraind&iacute;t&aacute;skor</b> - <em>Ezen a ponton csak a haszn&aacute;lni k&iacute;v&aacute;nt app.-ot sz&oacute;l&iacute;tja fel a ".so" mapp&aacute;k sz&uuml;ks&eacute;ges korrekci&oacute;j&aacute;ra. De egy&eacute;ni patchek nem l&eacute;teznek, kiv&eacute;ve a r&eacute;gi Titanium Backup-&eacute;t, amit m&aacute;r nem haszn&aacute;lunk. Nagyon instabilan m&ucirc;k&ouml;dik. K&iacute;v&aacute;natos, hogy hozz&aacute; legal&aacute;bb egy egy&eacute;ni patch. Ha sz&uuml;ks&eacute;ges a haszn&aacute;lata, akkor kell &iacute;rni egy egy&eacute;ni patch-et.</em><br/><br/>
<b>Utas&iacute;t&aacute;sok:</b><br/>
--------------<br/>

<b>A Licensz ellen&otilde;rz&eacute;s elt&aacute;vol&iacute;t&aacute;sa:</b><br/>
- C&eacute;lk&eacute;nt csak a fejleszt&otilde; &aacute;ltal szign&oacute;zott, eredeti apk f&aacute;jlokat haszn&aacute;ljon<br/>
- &Eacute;rintse meg a szoftvert &eacute;s v&aacute;lassza a "Licensz ellen&otilde;rz&eacute;s elt&aacute;vol&iacute;t&aacute;sa!" lehet&otilde;s&eacute;get<br/>
- V&aacute;lassza ki az "Auto m&oacute;d"ot &eacute;s tesztelje az alkalmaz&aacute;st Internet el&eacute;r&eacute;ssel<br/>
- Ha az eredm&eacute;ny negat&iacute;v, v&aacute;lassza ki az "Extr&eacute;m Auto m&oacute;d"ot<br/>
- Ha szerencs&eacute;je van a program m&aacute;r regisztr&aacute;lt!<br/>
- Ha visszat&eacute;rne az alkalmaz&aacute;s eredeti &aacute;llapot&aacute;hoz, &eacute;rintse meg az "ODEX v&aacute;ltoz&aacute;sok elt&aacute;vol&iacute;t&aacute;sa" lehet&otilde;s&eacute;get.<br/>
<br/>
<b>A Google Rekl&aacute;mok elt&aacute;vol&iacute;t&aacute;sa:</b><br/>
- &Eacute;rintse meg a szoftvert &eacute;s v&aacute;lassza a "Google Rekl&aacute;mok elt&aacute;vol&iacute;t&aacute;sa!" lehet&otilde;s&eacute;get<br/>
- Ind&iacute;tsa el &eacute;s tesztelje az alkalmaz&aacute;st Internet el&eacute;r&eacute;ssel<br/>
- Ha szerencs&eacute;je van, a Google Rekl&aacute;mok elt&ucirc;nnek <br/>
- Ha visszat&eacute;rne az alkalmaz&aacute;s eredeti &aacute;llapot&aacute;hoz, &eacute;rintse meg az "ODEX v&aacute;ltoz&aacute;sok elt&aacute;vol&iacute;t&aacute;sa" lehet&otilde;s&eacute;get.<br/>
<br/>
<b>Az egy&eacute;ni patch:</b><br/>
- &Eacute;rintse meg a szoftvert &eacute;s v&aacute;lassza a "Custom Patch!" lehet&otilde;s&eacute;get<br/>
- Ind&iacute;tsa el &eacute;s tesztelje az alkalmaz&aacute;st Internet el&eacute;r&eacute;ssel<br/>
- Ha szerencs&eacute;je van, a patch m&ucirc;k&ouml;dik<br/>
- Ha visszat&eacute;rne az alkalmaz&aacute;s eredeti &aacute;llapot&aacute;hoz, &eacute;rintse meg az "ODEX v&aacute;ltoz&aacute;sok elt&aacute;vol&iacute;t&aacute;sa" lehet&otilde;s&eacute;get.<br/>
<br/>
<b>Az enged&eacute;lyek m&oacute;dos&iacute;t&aacute;sa:</b><br/>
- &Eacute;rintse meg a szoftvert &eacute;s v&aacute;lassza az "Enged&eacute;lyek m&oacute;dos&iacute;t&aacute;sa"-t<br/>
- &Eacute;rintse meg, hogy tiltsa az enged&eacute;lyt <em style="color:#ff0000">(v&ouml;r&ouml;s)</em><br/>
- &Eacute;rintse meg, hogy enged&eacute;lyezze <em style="color:#36ff00">(z&ouml;ld)</em><br/>
- Meg kell meg&eacute;rinteni az "Alkalmaz"-&aacute;st (Reboot).<br/>
<br/>
<b>A m&oacute;dos&iacute;tott APK l&eacute;trehoz&aacute;sa:</b><br/>
- &Eacute;rintse meg a szoftvert &eacute;s v&aacute;lassza a "M&oacute;dos&iacute;tott APK l&eacute;trehoz&aacute;sa"-t<br/>
- Jel&ouml;lj&ouml;n ki patch-et az APK m&oacute;dos&iacute;t&aacute;s&aacute;hoz<br/>
- A m&oacute;dos&iacute;tott telep&iacute;t&otilde;f&aacute;jl ebben a mapp&aacute;ban lesz /sdcard/LuckPatcher/Modified/  <br/>
- Tudnia kell, hogy egy &uacute;jra&eacute;p&iacute;tett apk-f&aacute;jl nem ugyanaz, mint egy m&aacute;r telep&iacute;tett alkalmaz&aacute;s patch-el&eacute;se. Az alkalmaz&aacute;s patchel&eacute;s&eacute;vel szemben nagyon k&ouml;nny&ucirc; tesztelni a v&aacute;ltoz&aacute;sokat, a telep&iacute;t&eacute;st &eacute;s ellen&otilde;rizni a korrekt m&ucirc;k&ouml;d&eacute;st.<br/>
<br/>

<b>U.i.: A Patcher bez&aacute;rja az alkalmaz&aacute;st a jav&iacute;t&aacute;sok l&eacute;trehoz&aacute;sa miatt. Ez sz&uuml;ks&eacute;ges az &uacute;j v&aacute;ltoz&aacute;sok l&eacute;trej&ouml;tt&eacute;hez. De n&eacute;ha &uacute;jra kell ind&iacute;tania a k&eacute;sz&uuml;l&eacute;ket &ouml;nmag&aacute;nak, vagy haszn&aacute;lhat egy harmadik f&eacute;lt&otilde;l sz&aacute;rmaz&oacute; eszk&ouml;zt az alkalmaz&aacute;sok folyamatainak kil&ouml;v&eacute;s&eacute;re.</b>
</body>
